# Introdução à Ciência de Dados - UFPB
Professor: Yuri Malheiros

Alunos:

Filipe de Medeiros Santos

Lucas Miranda de Aguiar

Deivison Rodrigues Jordão

# Projeto de ICD

Exploração inicial dos datasets, calculando medidas de centralidade e dispersão dos valores disponíveis e plotar boxplots para os dados disponíveis nos datasets

In [2]:
import pandas as pd

database = pd.read_csv("healthcare-dataset-stroke-data.csv")
database.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

In [18]:
db_stroke = database[database["stroke"] == 1]
db_stroke.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

# 1. Análise Exploratória

As colunas do dataset trabalhadas em seguida dispõem de dados categóricos, tornando inviável a aplicação de medidas de centralidade e dispersão a essas colunas. Desta forma, será feita uma análise exploratória inicial com base na contagem da ocorrência dos valores categóricos.

## .1 Gender

In [11]:
db_gender = database["gender"]
db_gender.head()

0      Male
1    Female
2      Male
3    Female
4    Female
Name: gender, dtype: object

In [20]:
# Verificando a prevalência de gênero na base de dados

db_gender = db_gender.value_counts().to_frame()
db_gender

        gender
Female    2994
Male      2115
Other        1

In [26]:
# Incluindo a porcentagem de ocorrência por gênero
db_gender["gender_perc"] = db_gender["gender"] / db_gender["gender"].sum() * 100
db_gender

        gender  gender_perc
Female    2994    58.590998
Male      2115    41.389432
Other        1     0.019569

In [28]:
db_gender_1 = db_stroke["gender"]
db_gender_1.head()

0      Male
1    Female
2      Male
3    Female
4    Female
Name: gender, dtype: object

In [32]:
# Verificando a prevalência de gêneros das entradas em que houveram a ocorrência de AVC
# Incluindo a porcentagem no dataframe

db_gender["gender_1"] = db_gender_1.value_counts()
db_gender["gender_perc_1"] = db_gender["gender_1"] / db_gender["gender_1"].sum() * 100

db_gender

        gender  gender_perc  gender_1  gender_perc_1
Female    2994    58.590998     141.0      56.626506
Male      2115    41.389432     108.0      43.373494
Other        1     0.019569       NaN            NaN

## .2 Ever Married

In [34]:
db_married = database["ever_married"]
db_married.head()

0    Yes
1    Yes
2    Yes
3    Yes
4    Yes
Name: ever_married, dtype: object

In [35]:
# Verificando a prevalência de pessoas que já foram casadas na base de dados

db_married = db_married.value_counts().to_frame()
db_married

     ever_married
Yes          3353
No           1757

In [38]:
# Incluindo a porcentagem de ocorrência
db_married["married_perc"] = db_married["ever_married"] / db_married["ever_married"].sum() * 100
db_married

     ever_married  married_perc
Yes          3353     65.616438
No           1757     34.383562

In [39]:
db_married_1 = db_stroke["ever_married"]
db_married_1.head()

0    Yes
1    Yes
2    Yes
3    Yes
4    Yes
Name: ever_married, dtype: object

In [40]:
# Verificando a prevalência de pessoas que já foram casadas nas entradas em que houveram a ocorrência de AVC
# Incluindo a porcentagem no dataframe

db_married["ever_married_1"] = db_married_1.value_counts()
db_married["married_perc_1"] = db_married["ever_married_1"] / db_married["ever_married_1"].sum() * 100

db_married

     ever_married  married_perc  ever_married_1  married_perc_1
Yes          3353     65.616438             220       88.353414
No           1757     34.383562              29       11.646586

## .3 Work type

In [41]:
db_work = database["work_type"]
db_work.head()

0          Private
1    Self-employed
2          Private
3          Private
4    Self-employed
Name: work_type, dtype: object

In [42]:
# Verificando a prevalência do tipo de trabalho na base de dados

db_work = db_work.value_counts().to_frame()
db_work

               work_type
Private             2925
Self-employed        819
children             687
Govt_job             657
Never_worked          22

In [43]:
# Incluindo a porcentagem de ocorrência por tipo de trabalho
db_work["work_perc"] = db_work["work_type"] / db_work["work_type"].sum() * 100
db_work

               work_type  work_perc
Private             2925  57.240705
Self-employed        819  16.027397
children             687  13.444227
Govt_job             657  12.857143
Never_worked          22   0.430528

In [44]:
db_work_1 = db_stroke["work_type"]
db_work_1.head()

0          Private
1    Self-employed
2          Private
3          Private
4    Self-employed
Name: work_type, dtype: object

In [46]:
# Verificando a prevalência pelo tipo de trabalho das entradas em que houveram a ocorrência de AVC
# Incluindo a porcentagem no dataframe

db_work["work_type_1"] = db_work_1.value_counts()
db_work["work_perc_1"] = db_work["work_type_1"] / db_work["work_type_1"].sum() * 100

db_work

               work_type  work_perc  work_type_1  work_perc_1
Private             2925  57.240705        149.0    59.839357
Self-employed        819  16.027397         65.0    26.104418
children             687  13.444227          2.0     0.803213
Govt_job             657  12.857143         33.0    13.253012
Never_worked          22   0.430528          NaN          NaN